miro-kostadinov/tmos/trunk/tmos/hardware/lm3s/sysctl_lm3s.h
/**************************************************************************//**
 * @ingroup	 lm3s_sysctl
 * @{
 * @file     sysctl_lm3s.h
 * @brief    SYSCTL class header
 * @version  V3.00
 * @date     12. March 2010
 * @author	 Miroslav Kostadinov
 *
 *
 ******************************************************************************/
#ifndef SYSCTL_LM3S_H_
#define SYSCTL_LM3S_H_


/*----------       System Controller (SYSCTL)                     -----------*/
/// System Controller (SYSCTL)
struct SYSCTL_Type
{
    __I  uint32_t DID0;             //!< Device identification register 0
    __I  uint32_t DID1;             //!< Device identification register 1
    __I  uint32_t DC0;              //!< Device capabilities register 0
         uint8_t  RESERVED1[4];		//!< doc!
    __I  uint32_t DC1;              //!< Device capabilities register 1
    __I  uint32_t DC2;              //!< Device capabilities register 2
    __I  uint32_t DC3;              //!< Device capabilities register 3
    __I  uint32_t DC4;              //!< Device capabilities register 4
    __I  uint32_t DC5;              //!< Device capabilities register 5
    __I  uint32_t DC6;              //!< Device capabilities register 6
    __I  uint32_t DC7;              //!< Device capabilities register 7
    __I  uint32_t DC8;              //!< Device capabilities register 8
    __IO uint32_t PBORCTL;          //!< POR/BOR reset control register
    __IO uint32_t LDOPCTL;          //!< LDO power control register
         uint8_t  RESERVED2[8];		//!< doc!
    union{
    struct{
    __IO uint32_t SRCR0;            //!< Software reset control reg 0
    __IO uint32_t SRCR1;            //!< Software reset control reg 1
    __IO uint32_t SRCR2;            //!< Software reset control reg 2
    };
    __IO uint32_t SRCRRegs[3];
    };
         uint8_t  RESERVED3[4];		//!< doc!
    __I  uint32_t RIS;              //!< Raw interrupt status register
    __IO uint32_t IMC;              //!< Interrupt mask/control register
    __IO uint32_t MISC;             //!< Interrupt status register
    __IO uint32_t RESC;             //!< Reset cause register
    __IO uint32_t RCC;              //!< Run-mode clock config register
    __I  uint32_t PLLCFG;           //!< PLL configuration register
         uint8_t  RESERVED4[4];		//!< doc!
    __IO uint32_t GPIOHBCTL;        //!< GPIO High-Performance Bus Control
#define GPIOHSCTL GPIOHBCTL         //!< [__IO] GPIO High Speed Control
    __IO uint32_t RCC2;             //!< Run-mode clock config register 2
         uint8_t  RESERVED6[8];		//!< doc!
    __IO uint32_t MOSCCTL;          //!< Main Oscillator Control
         uint8_t  RESERVED7[128];	//!< doc!
    union{
    struct {
    __IO uint32_t RCGC0;            //!< Run-mode clock gating register 0
    __IO uint32_t RCGC1;            //!< Run-mode clock gating register 1
    __IO uint32_t RCGC2;            //!< Run-mode clock gating register 2
    };
    __IO uint32_t RCGCRegs[3];
    };
         uint8_t  RESERVED8[4];		//!< doc!
    union{
    struct{
    __IO uint32_t SCGC0;            //!< Sleep-mode clock gating reg 0
    __IO uint32_t SCGC1;            //!< Sleep-mode clock gating reg 1
    __IO uint32_t SCGC2;            //!< Sleep-mode clock gating reg 2
    };
    __IO uint32_t SCGCRegs[3];
	};
         uint8_t  RESERVED9[4];		//!< doc!
   union{
	struct {
    __IO uint32_t DCGC0;            //!< Deep Sleep-mode clock gate reg 0
    __IO uint32_t DCGC1;            //!< Deep Sleep-mode clock gate reg 1
    __IO uint32_t DCGC2;            //!< Deep Sleep-mode clock gate reg 2
	};
	__IO uint32_t DCGCRegs[3];
   };
         uint8_t  RESERVED10[24];	//!< doc!
    __IO uint32_t DSLPCLKCFG;       //!< Deep Sleep-mode clock config reg
         uint8_t  RESERVED11[8];	//!< doc!
    __IO uint32_t PIOSCCAL;         //!< Precision Internal Oscillator Calibration
    __I  uint32_t PIOSCSTAT;        //!< Precision Internal Oscillator Statistics
         uint8_t  RESERVED13[8];	//!< doc!
    __IO uint32_t LDOARST;          //!< LDO reset control register
         uint8_t  RESERVED14[12];	//!< doc!
    __IO uint32_t I2SMCLKCFG;       //!< I2S MCLK Configuration
         uint8_t  RESERVED15[28];	//!< doc!
    __I  uint32_t DC9;              //!< Device capabilities register 9
         uint8_t  RESERVED16[12];	//!< doc!
    __I  uint32_t NVMSTAT;          //!< Non-Volatile Memory Information
		 uint8_t  RESERVED17[44];	//!< doc!
	__IO uint32_t BOOTCFG;			//!< Boot Configuration
		 uint8_t  RESERVED18[12];	//!< doc!
	__IO uint32_t USER_REG0;		//!< User Register 0
	__IO uint32_t USER_REG1;		//!< User Register 1
	__IO uint32_t USER_REG2;		//!< User Register 2
	__IO uint32_t USER_REG3;		//!< User Register 3

    unsigned long SysCtlClockGet();
    unsigned long SysCtlSRAMSizeGet(void);
    unsigned long SysCtlFlashSizeGet(void);
    int SysCtlPeripheralPresent(unsigned long ulPeripheral);
    void SysCtlPeripheralSleepEnable(unsigned long ulPeripheral);
    void SysCtlPeripheralSleepDisable(unsigned long ulPeripheral);
    void SysCtlPeripheralDeepSleepEnable(unsigned long ulPeripheral);
    void SysCtlPeripheralDeepSleepDisable(unsigned long ulPeripheral);
    void SysCtlPeripheralClockGating(int bEnable);
    void SysCtlIntEnable(unsigned long ulInts);
    void SysCtlIntDisable(unsigned long ulInts);
    void SysCtlIntClear(unsigned long ulInts);
    unsigned long SysCtlIntStatus(int bMasked);
    void SysCtlLDOSet(unsigned long ulVoltage);
    unsigned long SysCtlLDOGet(void);
    void SysCtlLDOConfigSet(unsigned long ulConfig);
    unsigned long SysCtlResetCauseGet(void);
    void SysCtlResetCauseClear(unsigned long ulCauses);
    void SysCtlBrownOutConfigSet(unsigned long ulConfig, unsigned long ulDelay);
    void SysCtlClockSet(unsigned long ulConfig);
    void SysCtlPWMClockSet(unsigned long ulConfig);
    unsigned long SysCtlPWMClockGet(void);
    void SysCtlADCSpeedSet(unsigned long ulSpeed);
    unsigned long SysCtlADCSpeedGet(void);
    void SysCtlIOSCVerificationSet(int bEnable);
    void SysCtlMOSCVerificationSet(int bEnable);
    void SysCtlPLLVerificationSet(int bEnable);
    void SysCtlClkVerificationClear(void);
    void SysCtlGPIOAHBEnable(unsigned long ulGPIOPeripheral);
    void SysCtlGPIOAHBDisable(unsigned long ulGPIOPeripheral);
    void SysCtlUSBPLLEnable(void);
    void SysCtlUSBPLLDisable(void);
    unsigned long SysCtlI2SMClkSet(unsigned long ulInputClock, unsigned long ulMClk);

} ;

//
//	The following functions are outside of SYSCTL in order to reduce the calling code size

void SysCtlPeripheralEnable(unsigned long ulPeripheral);		//It is recommended to use Reset() instead when the peripheral is enabled for the first time
void SysCtlPeripheralReset(unsigned long ulPeripheral);
void SysCtlPeripheralDisable(unsigned long ulPeripheral);



// </g>
//*****************************************************************************
//
// The following are values that can be passed to the
// SysCtlPeripheralPresent(), SysCtlPeripheralEnable(),
// SysCtlPeripheralDisable(), and SysCtlPeripheralReset() APIs as the
// ulPeripheral parameter.  The peripherals in the fourth group (upper nibble
// is 3) can only be used with the SysCtlPeripheralPresent() API.
//
//*****************************************************************************
/*
#ifndef DEPRECATED
#define SYSCTL_PERIPH_WDOG      0x00000008  //!< Watchdog
#endif
#define SYSCTL_PERIPH_WDOG0     0x00000008  //!< Watchdog 0
#define SYSCTL_PERIPH_HIBERNATE 0x00000040  //!< Hibernation module
#ifndef DEPRECATED
#define SYSCTL_PERIPH_ADC       0x00100001  //!< ADC
#endif
#define SYSCTL_PERIPH_ADC0      0x00100001  //!< ADC0
#define SYSCTL_PERIPH_ADC1      0x00100002  //!< ADC1
#define SYSCTL_PERIPH_PWM       0x00100010  //!< PWM
#define SYSCTL_PERIPH_CAN0      0x00100100  //!< CAN 0
#define SYSCTL_PERIPH_CAN1      0x00100200  //!< CAN 1
#define SYSCTL_PERIPH_CAN2      0x00100400  //!< CAN 2
#define SYSCTL_PERIPH_WDOG1     0x00101000  //!< Watchdog 1
#define SYSCTL_PERIPH_UART0     0x10000001  //!< UART 0
#define SYSCTL_PERIPH_UART1     0x10000002  //!< UART 1
#define SYSCTL_PERIPH_UART2     0x10000004  //!< UART 2
#ifndef DEPRECATED
#define SYSCTL_PERIPH_SSI       0x10000010  //!< SSI
#endif
#define SYSCTL_PERIPH_SSI0      0x10000010  //!< SSI 0
#define SYSCTL_PERIPH_SSI1      0x10000020  //!< SSI 1
#ifndef DEPRECATED
#define SYSCTL_PERIPH_QEI       0x10000100  //!< QEI
#endif
#define SYSCTL_PERIPH_QEI0      0x10000100  //!< QEI 0
#define SYSCTL_PERIPH_QEI1      0x10000200  //!< QEI 1
#ifndef DEPRECATED
#define SYSCTL_PERIPH_I2C       0x10001000  //!< I2C
#endif
#define SYSCTL_PERIPH_I2C0      0x10001000  //!< I2C 0
#define SYSCTL_PERIPH_I2C1      0x10004000  //!< I2C 1
#define SYSCTL_PERIPH_TIMER0    0x10100001  //!< Timer 0
#define SYSCTL_PERIPH_TIMER1    0x10100002  //!< Timer 1
#define SYSCTL_PERIPH_TIMER2    0x10100004  //!< Timer 2
#define SYSCTL_PERIPH_TIMER3    0x10100008  //!< Timer 3
#define SYSCTL_PERIPH_COMP0     0x10100100  //!< Analog comparator 0
#define SYSCTL_PERIPH_COMP1     0x10100200  //!< Analog comparator 1
#define SYSCTL_PERIPH_COMP2     0x10100400  //!< Analog comparator 2
#define SYSCTL_PERIPH_I2S0      0x10101000  //!< I2S0
#define SYSCTL_PERIPH_EPI0      0x10104000  //!< EPI0
#define SYSCTL_PERIPH_GPIOA     0x20000001  //!< GPIO A
#define SYSCTL_PERIPH_GPIOB     0x20000002  //!< GPIO B
#define SYSCTL_PERIPH_GPIOC     0x20000004  //!< GPIO C
#define SYSCTL_PERIPH_GPIOD     0x20000008  //!< GPIO D
#define SYSCTL_PERIPH_GPIOE     0x20000010  //!< GPIO E
#define SYSCTL_PERIPH_GPIOF     0x20000020  //!< GPIO F
#define SYSCTL_PERIPH_GPIOG     0x20000040  //!< GPIO G
#define SYSCTL_PERIPH_GPIOH     0x20000080  //!< GPIO H
#define SYSCTL_PERIPH_GPIOJ     0x20000100  //!< GPIO J
#define SYSCTL_PERIPH_UDMA      0x20002000  //!< uDMA
#define SYSCTL_PERIPH_USB0      0x20100001  //!< USB0
#define SYSCTL_PERIPH_ETH       0x20105000  //!< ETH
#define SYSCTL_PERIPH_IEEE1588  0x20100100  //!< IEEE1588
#define SYSCTL_PERIPH_PLL       0x30000010  //!< PLL
#define SYSCTL_PERIPH_TEMP      0x30000020  //!< Temperature sensor
#define SYSCTL_PERIPH_MPU       0x30000080  //!< Cortex M3 MPU
*/

#define  ID_PERIPH_WDOG0       ((0<<5)|0x03) //!< Watchdog 0
#define  ID_PERIPH_HIBERNATE   ((0<<5)|0x06) //!< Hibernation module
#define  ID_PERIPH_ADC0        ((0<<5)|0x10) //!< ADC0
#define  ID_PERIPH_ADC1        ((0<<5)|0x11) //!< ADC1
#define  ID_PERIPH_PWM         ((0<<5)|0x14) //!< PWM
#define  ID_PERIPH_CAN0        ((0<<5)|0x18) //!< CAN 0
#define  ID_PERIPH_CAN1        ((0<<5)|0x19) //!< CAN 1
#define  ID_PERIPH_CAN2        ((0<<5)|0x1a) //!< CAN 2
#define  ID_PERIPH_WDOG1       ((0<<5)|0x1c) //!< Watchdog 1
#define  ID_PERIPH_UART0       ((1<<5)|0x00) //!< UART 0
#define  ID_PERIPH_UART1       ((1<<5)|0x01) //!< UART 1
#define  ID_PERIPH_UART2       ((1<<5)|0x02) //!< UART 2
#define  ID_PERIPH_SSI0        ((1<<5)|0x04) //!< SSI 0
#define  ID_PERIPH_SSI1        ((1<<5)|0x05) //!< SSI 1
#define  ID_PERIPH_QEI0        ((1<<5)|0x08) //!< QEI 0
#define  ID_PERIPH_QEI1        ((1<<5)|0x09) //!< QEI 1
#define  ID_PERIPH_I2C0        ((1<<5)|0x0c) //!< I2C 0
#define  ID_PERIPH_I2C1        ((1<<5)|0x0e) //!< I2C 1
#define  ID_PERIPH_TIMER0      ((1<<5)|0x10) //!< Timer 0
#define  ID_PERIPH_TIMER1      ((1<<5)|0x11) //!< Timer 1
#define  ID_PERIPH_TIMER2      ((1<<5)|0x12) //!< Timer 2
#define  ID_PERIPH_TIMER3      ((1<<5)|0x13) //!< Timer 3
#define  ID_PERIPH_COMP0       ((1<<5)|0x18) //!< Analog comparator 0
#define  ID_PERIPH_COMP1       ((1<<5)|0x19) //!< Analog comparator 1
#define  ID_PERIPH_COMP2       ((1<<5)|0x1a) //!< Analog comparator 2
#define  ID_PERIPH_I2S0        ((1<<5)|0x1c) //!< I2S0
#define  ID_PERIPH_EPI0        ((1<<5)|0x1e) //!< EPI0
#define  ID_PERIPH_GPIOA       ((2<<5)|0x00) //!< GPIO A
#define  ID_PERIPH_GPIOB       ((2<<5)|0x01) //!< GPIO B
#define  ID_PERIPH_GPIOC       ((2<<5)|0x02) //!< GPIO C
#define  ID_PERIPH_GPIOD       ((2<<5)|0x03) //!< GPIO D
#define  ID_PERIPH_GPIOE       ((2<<5)|0x04) //!< GPIO E
#define  ID_PERIPH_GPIOF       ((2<<5)|0x05) //!< GPIO F
#define  ID_PERIPH_GPIOG       ((2<<5)|0x06) //!< GPIO G
#define  ID_PERIPH_GPIOH       ((2<<5)|0x07) //!< GPIO H
#define  ID_PERIPH_GPIOJ       ((2<<5)|0x08) //!< GPIO J
#define  ID_PERIPH_UDMA        ((2<<5)|0x0d) //!< uDMA
#define  ID_PERIPH_USB0        ((2<<5)|0x10) //!< USB0
#define  ID_PERIPH_ETH         ((2<<5)|0x1c) //!< ETH
#define  ID_PERIPH_IEEE1588    ((2<<5)|0x18) //!< IEEE1588

